<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/5_Frame_Clause.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Frame Clause

## Overview

### ü•Ö Analysis Goals

Analyze cohort revenue and lifetime value (LTV) to uncover monthly trends, short-term fluctuations, future potential, and long-term customer value patterns.

- **Monthly Revenue Trends:** Calculate monthly net revenue for each cohort to track individual day performance without cumulative or rolling effects.  
- **Mid-Term Revenue Patterns:** Compute rolling 3-month revenue sums to smooth monthly fluctuations and reveal purchasing behaviors.  
- **Projected Short-Term Revenue:** Summarize net revenue for the next 3 months by cohort to identify patterns and assist in mid-term forecasting.

### üìò Concepts Covered

- `CURRENT ROW`
- `N PRECEDING`¬†
- `N FOLLOWING`¬†
- `UNBOUNDED`
    - `UNBOUNDED PRECEDING`
    - `UNBOUNDED FOLLOWING`¬†

---

In [1]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---

## CURRENT ROW

### üìù¬†Notes

`CURRENT ROW`

- **CURRENT ROW**: Refers to the current row in a window frame during a query execution.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Used to specify the row being processed as the start or end of a frame. Often combined with aggregations to apply calculations specific to the current row.

### üîë Key Concepts
- **üìä Business Terms**: 
  - Individual Order Value: Revenue from a single transaction
  - Point-in-Time Analysis: Examining metrics at a specific moment
  - Transaction-Level Detail: Granular view of each sale
- **üí° Why It Matters**: Enables precise analysis of individual order performance
    - Identifies specific high-value or low-value transactions
    - Helps spot anomalies in order patterns
    - Helps isolate daily performance trends for each cohort without being influenced by revenue on other days.
- **üéØ Common Use Cases**: Transaction monitoring, order analysis
- **üìà Related KPIs**: Order value, transaction frequency

### üìà Analysis

- Calculates the exact revenue for each individual order, providing a precise view of transaction-level performance without any aggregation.
- Calculates the exact net revenue for each cohort on a daily basis without rolling or cumulative sums.

### Current Row Revenue

**`CURRENT ROW`**

1. Calculate the exact revenue for each order using `CURRENT ROW`.
   - Select `orderdate` to identify each transaction
   - Calculate revenue using `quantity * netprice * exchangerate`
   - Use `CURRENT ROW` frame to isolate individual order revenue
   - Order by `orderdate` to see chronological progression

In [7]:
%%sql


SELECT 
    orderdate,
    SUM(quantity * netprice * exchangerate) OVER (
        ORDER BY orderdate
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) as order_revenue
FROM sales
ORDER BY orderdate;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

         orderdate  order_revenue
0       2015-01-01          63.49
1       2015-01-01         423.28
2       2015-01-01         108.75
3       2015-01-01        1146.75
4       2015-01-01         950.25
...            ...            ...
199868  2024-04-20         914.61
199869  2024-04-20         150.18
199870  2024-04-20         147.78
199871  2024-04-20        2019.62
199872  2024-04-20          56.83

[199873 rows x 2 columns]

#### Daily Revenue by Cohort

**`CURRENT ROW`**

1. Get the `cohort_year` for each customer and the total revenue for each day.  
   - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer based on their earliest order date.  
   - Include `customerkey` in the `GROUP BY` clause to ensure the cohort year is assigned to each customer individually.  
   - Include `orderdate` in the `GROUP BY` clause to calculate daily revenue for each customer.  
   - Use `SUM(quantity * netprice * exchangerate)` to calculate the total net revenue for each day.  
   - Select `customerkey`, `cohort_year`, `orderdate`, and `total_net_revenue` for the final output.

In [28]:
%%sql

SELECT 
    customerkey,
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
    orderdate,
    SUM(quantity * netprice * exchangerate) AS total_net_revenue
FROM sales
GROUP BY 
    customerkey, 
    orderdate

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

83099 rows affected.

       customerkey cohort_year   orderdate  total_net_revenue
0          1506769        2022  2022-03-04             996.79
1           909157        2021  2021-11-16            1565.80
2          2047462        2020  2020-12-09              34.06
3          1933480        2021  2021-11-10              45.90
4          1701958        2017  2017-10-05            5144.64
...            ...         ...         ...                ...
83094      1273185        2023  2023-09-16            3452.05
83095       420797        2022  2022-12-29             278.90
83096       642485        2023  2023-03-08             574.31
83097       863441        2023  2023-03-23             475.84
83098       389153        2023  2023-11-28           19496.16

[83099 rows x 4 columns]

2. Create a CTE to calculate the cohort year for each day and return all results in the main query.  
   - üîî Define a CTE `cohort_analysis` to calculate the cohort year and total daily revenue for each customer.  
      - Use `EXTRACT(YEAR FROM MIN(orderdate))` to determine the cohort year for each customer based on their earliest order date.  
      - Group the CTE by `customerkey` and `orderdate` to calculate daily net revenue per customer.  
      - Use `SUM(quantity * netprice * exchangerate)` to compute the total net revenue for each day.  
   - üîî In the main query, use `SELECT * FROM cohort_analysis` to return all calculated results, including `customerkey`, `cohort_year`, `orderdate`, and `total_net_revenue`.

In [24]:
%%sql

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        customerkey, 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year, 
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        customerkey, 
        orderdate
)

-- Added a SELECT statement to query the CTE
SELECT *
FROM cohort_analysis;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

83099 rows affected.

       customerkey cohort_year   orderdate  total_net_revenue
0          1506769        2022  2022-03-04             996.79
1           909157        2021  2021-11-16            1565.80
2          2047462        2020  2020-12-09              34.06
3          1933480        2021  2021-11-10              45.90
4          1701958        2017  2017-10-05            5144.64
...            ...         ...         ...                ...
83094      1273185        2023  2023-09-16            3452.05
83095       420797        2022  2022-12-29             278.90
83096       642485        2023  2023-03-08             574.31
83097       863441        2023  2023-03-23             475.84
83098       389153        2023  2023-11-28           19496.16

[83099 rows x 4 columns]

3. Add a new CTE to get the total daily revenue for each cohort and return all results in the main query.  

   - Define a CTE `cohort_analysis` to calculate the cohort year and total daily revenue for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to determine the cohort year for each customer based on their earliest order date.  
        - Group `cohort_analysis` by `customerkey` and `orderdate` to compute the total net revenue for each customer per day using `SUM(quantity * netprice * exchangerate)`.  
   - üîî Add a second CTE `cohort_summary` to aggregate monthly revenue for each cohort.  
        - Use `SUM(total_net_revenue)` in `cohort_summary` to calculate the monthly total revenue for all customers within each cohort. 
        - Get the order year month from `orderdate` using `DATE_TRUNC`.
        - Group `cohort_summary` by `cohort_year` and `year_month` to summarize the data at the cohort and daily level.  
   - üîî In the main query, select all columns from `cohort_summary` to display `cohort_year`, `year_month`, and `total_revenue`.  
        - Use `ORDER BY cohort_year, year_month` to sort the results by cohort year and the order year-month in ascending order.

In [2]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year, 
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        customerkey, 
        orderdate
), 

-- Added 
cohort_summary AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month', orderdate) AS year_month,
        SUM(total_net_revenue) AS total_revenue
    FROM cohort_analysis
    GROUP BY 
        cohort_year, 
        year_month
)

-- Updated 
SELECT
    *
FROM cohort_summary
ORDER BY 
    cohort_year, 
    year_month;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

112 rows affected.

    cohort_year                 year_month  total_revenue
0          2015  2015-01-01 00:00:00-08:00      384092.66
1          2015  2015-02-01 00:00:00-08:00      706374.12
2          2015  2015-03-01 00:00:00-08:00      332961.59
3          2015  2015-04-01 00:00:00-07:00      160767.00
4          2015  2015-05-01 00:00:00-07:00      548632.63
..          ...                        ...            ...
107        2023  2023-12-01 00:00:00-08:00     2928550.93
108        2024  2024-01-01 00:00:00-08:00     2677498.55
109        2024  2024-02-01 00:00:00-08:00     3542322.55
110        2024  2024-03-01 00:00:00-08:00     1692854.89
111        2024  2024-04-01 00:00:00-07:00      483851.39

[112 rows x 3 columns]

4. In the main query, use `CURRENT ROW` to get the daily net revenue for each cohort.  

   - Define the CTE `cohort_analysis` to calculate the cohort year and daily net revenue for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to determine the cohort year for each customer.  
        - Aggregate `total_net_revenue` in `cohort_analysis` by grouping on `customerkey` and `orderdate`.  
   - Define a second CTE `cohort_summary` to calculate the monthly total revenue for each cohort.  
        - Use `SUM(total_net_revenue)` in `cohort_summary` to calculate the monthly total revenue for all customers within each cohort. 
        - Get the order year month from `orderdate` using `DATE_TRUNC`.
        - Group `cohort_summary` by `cohort_year` and `year_month` to summarize the data at the cohort and daily level.  
   - In the main query, use a window function to calculate the monthly net revenue for each cohort.  
        - üîî Apply `SUM(total_revenue) OVER (PARTITION BY cohort_year ORDER BY year_month ROWS BETWEEN CURRENT ROW AND CURRENT ROW)` to get the revenue for the current row.  
        - Select `cohort_year`, `year_month`, and `monthly_net_revenue` for the output.  
        - Order the results by `cohort_year` and `year_month` to display them in chronological order for each cohort.

In [5]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year, 
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        customerkey, 
        orderdate
),
cohort_summary AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month', orderdate) AS year_month,
        SUM(total_net_revenue) AS total_revenue
    FROM cohort_analysis
    GROUP BY 
        cohort_year, 
        year_month
)

SELECT
    cohort_year,
    year_month,
    -- Added
    SUM(total_revenue) OVER (
        PARTITION BY cohort_year -- Separate aggregation for each cohort
        ORDER BY year_month
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) AS monthly_net_revenue
FROM cohort_summary
ORDER BY 
    cohort_year, 
    year_month;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

112 rows affected.

    cohort_year                 year_month  monthly_net_revenue
0          2015  2015-01-01 00:00:00-08:00            384092.66
1          2015  2015-02-01 00:00:00-08:00            706374.12
2          2015  2015-03-01 00:00:00-08:00            332961.59
3          2015  2015-04-01 00:00:00-07:00            160767.00
4          2015  2015-05-01 00:00:00-07:00            548632.63
..          ...                        ...                  ...
107        2023  2023-12-01 00:00:00-08:00           2928550.93
108        2024  2024-01-01 00:00:00-08:00           2677498.55
109        2024  2024-02-01 00:00:00-08:00           3542322.55
110        2024  2024-03-01 00:00:00-08:00           1692854.89
111        2024  2024-04-01 00:00:00-07:00            483851.39

[112 rows x 3 columns]

<img src="../Resources/images/3.5_monthly_cohort_rev.png" alt="Monthly Cohort Revenue" width="50%">

---

## N PRECEDING

`PRECEDING`

- **N PRECEDING**: Refers to `N` rows before the current row in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN N PRECEDING AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Enables calculations involving the current row and up to `N` preceding rows, such as moving averages or cumulative sums for a fixed number of rows.

### üîë Key Concepts
- **üìä Business Terms**: 
  - Rolling Window: Moving period of analysis
  - Sequential Analysis: Study of consecutive transactions
  - Moving Average: Average over a sliding timeframe
- **üí° Why It Matters**: Reveals trends by smoothing out daily fluctuations
    - Shows short-term patterns in customer behavior
    - Helps identify seasonal or cyclical trends
    - Identifies mid-term trends in net revenue, such as monthly purchasing patterns.
- **üéØ Common Use Cases**: Trend analysis, pattern detection
- **üìà Related KPIs**: Rolling revenue, moving averages

### üìà Analysis

- Calculates a 7-day rolling sum of revenue that includes the current order and previous 6 orders, smoothing out daily fluctuations to reveal short-term trends.
- Computes the rolling 3-month sum of net revenue for each cohort, smoothing fluctuations in monthly revenue.

### Rolling Order Revenue

**`N PRECEDING`**

1. Calculate a rolling sum of revenue that includes the current order and previous 6 orders using `N PRECEDING`.
   - Select `orderdate` to identify each transaction
   - Calculate revenue using `quantity * netprice * exchangerate`
   - Use `6 PRECEDING` frame to include previous 6 orders in calculation
   - Order by `orderdate` to ensure proper sequential calculation

In [9]:
%%sql

SELECT 
    orderdate,
    (quantity * netprice * exchangerate) AS net_revenue,
    SUM(quantity * netprice * exchangerate) OVER (
        ORDER BY orderdate
        ROWS BETWEEN 6 PRECEDING AND CURRENT ROW
    ) as rolling_7order_revenue
FROM sales
ORDER BY orderdate;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

         orderdate  net_revenue  rolling_7order_revenue
0       2015-01-01        63.49                   63.49
1       2015-01-01       423.28                  486.77
2       2015-01-01       108.75                  595.53
3       2015-01-01      1146.75                 1742.27
4       2015-01-01       950.25                 2692.52
...            ...          ...                     ...
199868  2024-04-20       914.61                 5990.26
199869  2024-04-20       150.18                 6126.09
199870  2024-04-20       147.78                 6012.55
199871  2024-04-20      2019.62                 7993.23
199872  2024-04-20        56.83                 7385.91

[199873 rows x 3 columns]

#### 3-Month Rolling Revenue by Cohort

**`PRECEEDING`**

1. Use the previous query and add a new windows function to calculate the rolling 30-day net revenue using `PRECEDING`.  
   - Define the CTE `cohort_analysis` to calculate the cohort year and daily net revenue for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to determine the cohort year for each customer.  
        - Aggregate `total_net_revenue` in `cohort_analysis` by grouping on `customerkey` and `orderdate`.  
   - Define the second CTE `cohort_summary` to calculate the monthly total revenue for each cohort.  
        - Use `SUM(total_net_revenue)` in `cohort_summary` to aggregate the monthly total revenue for each cohort, grouped by `cohort_year` and `year_month`.  
   - In the main query, calculate the rolling 3-month net revenue for each cohort using a window function.  
        - Apply `SUM(total_revenue) OVER (PARTITION BY cohort_year ORDER BY year_month ROWS BETWEEN CURRENT ROW AND CURRENT ROW)` to get the revenue for the current row.  
        - üîî Apply `SUM(total_revenue) OVER (PARTITION BY cohort_year ORDER BY year_month ROWS BETWEEN 2 PRECEDING AND CURRENT ROW)` to include revenue from the current day and the previous 2 months.  
        - Select `cohort_year`, `year_month`, and `rolling_30_day_net_revenue` for the output.  
        - Use `ORDER BY cohort_year, year_month` to ensure results are sorted chronologically by cohort and date.

In [12]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year, 
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        customerkey, 
        orderdate
),

cohort_summary AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month', orderdate) AS year_month,
        SUM(total_net_revenue) AS total_revenue
    FROM cohort_analysis
    GROUP BY cohort_year, year_month
)

SELECT
    cohort_year,
    year_month,
    SUM(total_revenue) OVER (
        PARTITION BY cohort_year
        ORDER BY year_month
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) AS monthly_net_revenue,
    -- Added
    SUM(total_revenue) OVER (
        PARTITION BY cohort_year
        ORDER BY year_month
        ROWS BETWEEN 3 PRECEDING AND CURRENT ROW
    ) AS rolling_30_day_net_revenue
FROM cohort_summary
ORDER BY 
    cohort_year, 
    year_month;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

112 rows affected.

,cohort_year,year_month,monthly_net_revenue,rolling_30_day_net_revenue
0,2015,2015-01-01 00:00:00-08:00,384092.66,384092.66
1,2015,2015-02-01 00:00:00-08:00,706374.12,1090466.78
2,2015,2015-03-01 00:00:00-08:00,332961.59,1423428.37
3,2015,2015-04-01 00:00:00-07:00,160767.00,1584195.37
4,2015,2015-05-01 00:00:00-07:00,548632.63,1748735.34
...,...,...,...,...
107,2023,2023-12-01 00:00:00-08:00,2928550.93,10802751.76
108,2024,2024-01-01 00:00:00-08:00,2677498.55,2677498.55
109,2024,2024-02-01 00:00:00-08:00,3542322.55,6219821.10
110,2024,2024-03-01 00:00:00-08:00,1692854.89,7912675.99
111,2024,2024-04-01 00:00:00-07:00,483851.39,8396527.38

<img src="../Resources/images/3.4_cohort_ltv_change_prev.png" alt="Cohort LTV Change" width="50%">

---
## N FOLLOWING

### üìù¬†Notes

`N FOLLOWING`

- **N FOLLOWING**: Refers to `N` rows after the current row in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND N FOLLOWING
    ) AS window_column_alias
  FROM table_name;
  ```
- Useful for calculating aggregations involving the current row and a specified number of subsequent rows, such as projecting future totals or averages.

### üîë Key Concepts
- **üìä Business Terms**: 
  - Forward Analysis: Looking at upcoming transactions
  - Future Value: Revenue from subsequent orders
  - Predictive Window: Period of future analysis
- **üí° Why It Matters**: Projects short-term future performance
    - Anticipates upcoming revenue patterns
    - Identifies potential changes in customer behavior
    - Useful for forecasting and identifying patterns in purchasing activity after a given month.
- **üéØ Common Use Cases**: Short-term forecasting, trend prediction
- **üìà Related KPIs**: Forward revenue, future order value

### üìà Analysis

- Calculates the total revenue for the current order plus the next 2 orders, providing a forward-looking view of short-term revenue patterns.
- Summarizes the next 3 months of net revenue for each cohort and month, projecting mid-term revenue performance.

### Forward-Looking Revenue

**`N FOLLOWING`**

1. Calculate the sum of revenue for the current order and next 2 orders using `2 FOLLOWING`.
   - Select `orderdate` to identify each transaction
   - Calculate revenue using `quantity * netprice * exchangerate`
   - Use `2 FOLLOWING` frame to include next 2 orders in calculation
   - Order by `orderdate` to ensure proper sequential calculation

In [10]:
%%sql

SELECT 
    orderdate,
    (quantity * netprice * exchangerate) AS net_revenue,
    SUM(quantity * netprice * exchangerate) OVER (
        ORDER BY orderdate
        ROWS BETWEEN CURRENT ROW AND 2 FOLLOWING
    ) as next_3order_revenue
FROM sales
ORDER BY orderdate;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

         orderdate  net_revenue  next_3order_revenue
0       2015-01-01        63.49               595.53
1       2015-01-01       423.28              1678.78
2       2015-01-01       108.75              2205.75
3       2015-01-01      1146.75              3399.91
4       2015-01-01       950.25              2311.90
...            ...          ...                  ...
199868  2024-04-20       914.61              1212.57
199869  2024-04-20       150.18              2317.58
199870  2024-04-20       147.78              2224.23
199871  2024-04-20      2019.62              2076.45
199872  2024-04-20        56.83                56.83

[199873 rows x 3 columns]

#### Future 3-Month Revenue by Cohort

**`FOLLOWING`**

1. Use the previous query and update`rolling_30_day_net_revenue` to calculate the next 3-month net revenue using `FOLLOWING`.  
   - Define the CTE `cohort_analysis` to calculate the cohort year and daily net revenue for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to determine the cohort year for each customer based on their earliest order.  
        - Group `cohort_analysis` by `customerkey` and `orderdate` to calculate the daily `total_net_revenue` for each customer.  
   - Define the second CTE `cohort_summary` to calculate the total revenue for each cohort by day.  
        - Use `SUM(total_net_revenue)` in `cohort_summary` to aggregate the monthly total revenue for each cohort, grouped by `cohort_year` and `year_month`.  
   - In the main query, calculate the next 3-month net revenue for each cohort using a window function.  
        - Apply `SUM(total_revenue) OVER (PARTITION BY cohort_year ORDER BY year_month ROWS BETWEEN CURRENT ROW AND CURRENT ROW)` to get the revenue for the current row.  
        - üîî Apply `SUM(total_revenue) OVER (PARTITION BY cohort_year ORDER BY year_month ROWS BETWEEN CURRENT ROW AND 3 FOLLOWING)` to include revenue from the current day and the next 3 months.  
        - Select `cohort_year`, `year_month`, and `rolling_3_day_net_revenue` for the output.  
        - Use `ORDER BY cohort_year, orderdate` to ensure results are sorted chronologically by cohort and month.

In [17]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year, 
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        customerkey, 
        orderdate
),

cohort_summary AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month', orderdate) AS year_month,
        SUM(total_net_revenue) AS total_revenue
    FROM cohort_analysis
    GROUP BY cohort_year, year_month
)

SELECT
    cohort_year,
    year_month,
    SUM(total_revenue) OVER (
        PARTITION BY cohort_year
        ORDER BY year_month
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) AS monthly_net_revenue,
    SUM(total_revenue) OVER (
        PARTITION BY cohort_year
        ORDER BY year_month 
        ROWS BETWEEN CURRENT ROW AND 3 FOLLOWING
    ) AS rolling_3_month_net_revenue
FROM cohort_summary
ORDER BY 
    cohort_year, 
    year_month
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

112 rows affected.

,cohort_year,year_month,monthly_net_revenue,rolling_3_month_net_revenue
0,2015,2015-01-01 00:00:00-08:00,384092.66,1584195.37
1,2015,2015-02-01 00:00:00-08:00,706374.12,1748735.34
2,2015,2015-03-01 00:00:00-08:00,332961.59,1790925.19
3,2015,2015-04-01 00:00:00-07:00,160767.00,2093339.73
4,2015,2015-05-01 00:00:00-07:00,548632.63,2651111.35
...,...,...,...,...
107,2023,2023-12-01 00:00:00-08:00,2928550.93,2928550.93
108,2024,2024-01-01 00:00:00-08:00,2677498.55,8396527.38
109,2024,2024-02-01 00:00:00-08:00,3542322.55,5719028.83
110,2024,2024-03-01 00:00:00-08:00,1692854.89,2176706.28
111,2024,2024-04-01 00:00:00-07:00,483851.39,483851.39

<img src="../Resources/images/3.4_cohort_ltv_change_prev.png" alt="Cohort LTV Change" width="50%">

---
## UNBOUNDED

### üìù¬†Notes

`UNBOUNDED PRECEDING`

- **UNBOUNDED PRECEDING**: Refers to the first row of the partition or dataset in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Commonly used for cumulative calculations starting from the beginning of a partition, such as running totals or cumulative averages.

`UNBOUNDED FOLLOWING`

- **UNBOUNDED FOLLOWING**: Refers to the last row of the partition or dataset in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING
    ) AS window_column_alias
  FROM table_name;
  ```
- Often used to aggregate values from the current row to the end of the partition, such as totals or counts of future data.

### üîë Key Concepts
- **üìä Business Terms**: 
  - Cumulative Total: Running sum of all values
  - Historical Performance: Complete transaction history
  - Aggregate Growth: Total accumulation over time
- **üí° Why It Matters**: Shows complete historical performance
    - Tracks long-term cohort growth and overall net revenue contributions over time.
    - Assists in understanding future net revenue potential from a given point in time.
- **üéØ Common Use Cases**: Growth analysis, performance tracking
- **üìà Related KPIs**: Total revenue, growth rate

### üìà Analysis
- Calculates the running total of all revenue from the very first order up to each current order, showing the complete accumulation of revenue over time.
- Calculates the total accumulated net revenue up to each month for every cohort.
- Measures remaining cumulative net revenue from each order month to the end of the cohort‚Äôs activity.

### Cumulative Revenue

**`UNBOUNDED PRECEDING`**

1. Calculate the running total of revenue from the first order up to each current order using `UNBOUNDED PRECEDING`.
   - Select `orderdate` to identify each transaction
   - Calculate revenue using `quantity * netprice * exchangerate`
   - Use `UNBOUNDED PRECEDING` frame to include all previous orders
   - Order by `orderdate` to ensure proper cumulative calculation

In [11]:
%%sql

SELECT 
    orderdate,
    (quantity * netprice * exchangerate) AS net_revenue,
    SUM(quantity * netprice * exchangerate) OVER (
        ORDER BY orderdate
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) as cumulative_revenue
FROM sales
ORDER BY orderdate;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

         orderdate  net_revenue  cumulative_revenue
0       2015-01-01        63.49               63.49
1       2015-01-01       423.28              486.77
2       2015-01-01       108.75              595.53
3       2015-01-01      1146.75             1742.27
4       2015-01-01       950.25             2692.52
...            ...          ...                 ...
199868  2024-04-20       914.61        206405164.17
199869  2024-04-20       150.18        206405314.35
199870  2024-04-20       147.78        206405462.13
199871  2024-04-20      2019.62        206407481.75
199872  2024-04-20        56.83        206407538.58

[199873 rows x 3 columns]

#### Cumulative Revenue from First Order

**`UNBOUNDED  PRECEDING`**

1. Use the previous query and update the `rolling_7_day_net_revenue` to calculate the cumulative net revenue starting from the first row using `UNBOUNDED PRECEDING`.  
   - Define the CTE `cohort_analysis` to calculate the cohort year and daily net revenue for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to determine the cohort year for each customer based on their earliest order.  
        - Group `cohort_analysis` by `customerkey` and `orderdate` to calculate `total_net_revenue` for each day per customer.  
   - Define the second CTE `cohort_summary` to calculate the monthly total revenue.  
        - Use `SUM(total_net_revenue)` in `cohort_summary` to aggregate the total revenue for all customers within each cohort, grouped by `cohort_year` and `year_month`.  
   - In the main query, calculate the cumulative net revenue starting from the first row using a window function.  
        - üîî Apply `SUM(total_revenue) OVER (PARTITION BY cohort_year ORDER BY year_month ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW)` to include all rows from the beginning up to the current row.  
        - Select `cohort_year`, `year_month`, and `cumulative_net_revenue` for the output.  
        - Use `ORDER BY cohort_year, year_month` to ensure results are sorted chronologically by cohort and date.

In [20]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year, 
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        customerkey, 
        orderdate
),

cohort_summary AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month', orderdate) AS year_month,
        SUM(total_net_revenue) AS total_revenue
    FROM cohort_analysis
    GROUP BY cohort_year, year_month
)

SELECT
    cohort_year,
    year_month,
    SUM(total_revenue) OVER (
        PARTITION BY cohort_year
        ORDER BY year_month 
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW -- Updated
    ) AS cumulative_net_revenue
FROM cohort_summary
ORDER BY 
    cohort_year, 
    year_month
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

112 rows affected.

    cohort_year                 year_month  cumulative_net_revenue
0          2015  2015-01-01 00:00:00-08:00               384092.66
1          2015  2015-02-01 00:00:00-08:00              1090466.78
2          2015  2015-03-01 00:00:00-08:00              1423428.37
3          2015  2015-04-01 00:00:00-07:00              1584195.37
4          2015  2015-05-01 00:00:00-07:00              2132828.00
..          ...                        ...                     ...
107        2023  2023-12-01 00:00:00-08:00             33108565.51
108        2024  2024-01-01 00:00:00-08:00              2677498.55
109        2024  2024-02-01 00:00:00-08:00              6219821.10
110        2024  2024-03-01 00:00:00-08:00              7912675.99
111        2024  2024-04-01 00:00:00-07:00              8396527.38

[112 rows x 3 columns]

<img src="../Resources/images/3.4_cohort_ltv_change_prev.png" alt="Cohort LTV Change" width="50%">

#### Remaining Revenue After Each Order

**`UNBOUNDED FOLLOWING`**

1. Use the previous query and update the `cumulative_net_revenue` to calculate the total net revenue from the current month to the end using `UNBOUNDED FOLLOWING`.  

   - Define the CTE `cohort_analysis` to calculate the cohort year and daily net revenue for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` to determine the cohort year for each customer based on their earliest order.  
        - Group `cohort_analysis` by `customerkey` and `orderdate` to calculate `total_net_revenue` for each day per customer.  
   - Define the second CTE `cohort_summary` to calculate the monthly total revenue for each cohort.  
        - Use `SUM(total_net_revenue)` in `cohort_summary` to aggregate the total revenue for all customers within each cohort, grouped by `cohort_year` and `year_month`.  
   - In the main query, calculate the total net revenue from the current date to the end using a window function.  
        - üîî Apply `SUM(total_revenue) OVER (PARTITION BY cohort_year ORDER BY year_month ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING)` to include all rows from the current row to the last month.  
        - Select `cohort_year`, `year_month`, and `remaining_net_revenue` for the output.  
        - Use `ORDER BY cohort_year, year_month` to ensure results are sorted chronologically by cohort and month.

In [21]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year, 
        orderdate,
        SUM(quantity * netprice * exchangerate) AS total_net_revenue
    FROM sales
    GROUP BY 
        customerkey, 
        orderdate
),

cohort_summary AS (
    SELECT
        cohort_year,
        DATE_TRUNC('month', orderdate) AS year_month,
        SUM(total_net_revenue) AS total_revenue
    FROM cohort_analysis
    GROUP BY cohort_year, year_month
)

SELECT
    cohort_year,
    year_month,
    SUM(total_revenue) OVER (
        PARTITION BY cohort_year
        ORDER BY year_month
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING -- Updated
    ) AS remaining_net_revenue
FROM cohort_summary
ORDER BY 
    cohort_year, 
    year_month
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

112 rows affected.

    cohort_year                 year_month  remaining_net_revenue
0          2015  2015-01-01 00:00:00-08:00             7370979.48
1          2015  2015-02-01 00:00:00-08:00             6986886.82
2          2015  2015-03-01 00:00:00-08:00             6280512.70
3          2015  2015-04-01 00:00:00-07:00             5947551.11
4          2015  2015-05-01 00:00:00-07:00             5786784.11
..          ...                        ...                    ...
107        2023  2023-12-01 00:00:00-08:00             2928550.93
108        2024  2024-01-01 00:00:00-08:00             8396527.38
109        2024  2024-02-01 00:00:00-08:00             5719028.83
110        2024  2024-03-01 00:00:00-08:00             2176706.28
111        2024  2024-04-01 00:00:00-07:00              483851.39

[112 rows x 3 columns]

<img src="../Resources/images/3.4_cohort_ltv_change_prev.png" alt="Cohort LTV Change" width="50%">